#include <iostream>
#include <locale>
using namespace std;
int main(){
    setlocale(LC_ALL,".65001"); //. подключение кириллицы
    {
        int n = 4; //. задали переменную n и её значение
        int m = 5; //. задали переменную m и её значение
        cout << "Первое выражение: " << (n++ *m) << endl;
        /* значение 1 выражения.
        Инкремент в выражении стоит после n, значит, сначала пройдёт операция: 4+5,
        и только после этого n примет значение: n+1 = 5
        */
    }
    {
        int n = 4;
        int m = 5;
        cout << "Второе выражение: " << (n++ <m) << endl;
        /* значение 2 выражения.
        Инкремент в выражении стоит после n, значит, сначала пройдёт операция: 4<5,
        что является true, поэтому программа выдаст ответ: 1,
        и только после этого n примет значение: n+1 = 5
        */
    }
    {
        int n = 4;
        int m = 5;
        cout << "Третье выражение: " << (m-- >m) << endl;
        /* значение 3 выражения.
        Декремент в выражении стоит после m, значит, сначала пройдёт операция: 5>5,
        что является false, поэтому программа выдаст: 0,
        и только после этого m примет значение: m-1 = 4
        */
    }
    return 0;
}
